---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.FamilyMismatchCircuitDisconnected
source: html/35ea60f0-74e3-bf4f-0c1d-ef71884330c8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures.FamilyMismatchCircuitDisconnected Property

The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyMismatchCircuitDisconnected { get; }
```